In [298]:
import pandas as pd
import numpy as np

### Ticket sales in Europe

In [299]:
df_admissions_EU = pd.read_csv('./data/Movie_numbers_1996-2023_EU.csv')

In [300]:
df_admissions_EU.isnull().sum()

Original title              0
Producing country           0
Production year             0
Directors                   0
Admissions 1996-1996        0
Total EU27+GB since 1996    0
dtype: int64

In [301]:
df_admissions_EU.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5600 entries, 0 to 5599
Data columns (total 6 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Original title            5600 non-null   object
 1   Producing country         5600 non-null   object
 2   Production year           5600 non-null   int64
 3   Directors                 5600 non-null   object
 4   Admissions 1996-1996      5600 non-null   object
 5   Total EU27+GB since 1996  5600 non-null   object
dtypes: int64(1), object(5)
memory usage: 262.6+ KB

In [302]:
df_admissions_EU.head(20)

,Original title,Producing country,Production year,Directors,Admissions 1996-1996,Total EU27+GB since 1996
0,Independence Day,US,1996,Roland Emmerich,42 186 676,42 600 343
1,Mission: Impossible,US,1996,Brian De Palma,22 411 551,22 718 868
2,Se7en,US,1995,David Fincher,20 292 869,20 420 775
3,The Hunchback of Notre Dame,US,1996,"Gary Trousdale, Kirk Wise",19 576 371,24 660 478
4,Twister,US,1996,Jan de Bont,18 889 123,19 039 314
5,Toy Story,US,1995,John Lasseter,18 113 885,18 807 011
6,The Rock,US,1996,Michael Bay,16 511 947,16 828 183
7,The Nutty Professor,US,1996,Tom Shadyac,15 943 686,16 384 213
8,Jumanji,US,1995,Joe Johnston,13 237 471,13 298 839
9,Dangerous Minds,US,1995,John N. Smith,11 967 051,11 989 709
10,GoldenEye,"GBinc, US",1995,Martin Campbell,11 046 835,11 070 129
11,Babe,"AU, US",1995,Chris Noonan,10 549 641,10 621 705
12,Sense and Sensibility,"US, GB",1995,Ang Lee,10 346 450,10 375 938
13,Twelve Monkeys,US,1995,Terry Gilliam,10 110 055,10 348 799
14,Heat,US,1995,Michael Mann,9 936 691,9 964 674
15,Eraser,US,1996,Chuck Russell,9 227 852,9 341 118
16,Trainspotting,GB,1996,Danny Boyle,8 402 151,9 253 707
17,Spy Hard,US,1996,Rick Friedberg,6 912 414,6 990 772
18,Casino,US,1995,Martin Scorsese,6 281 693,6 324 541
19,Striptease,US,1996,Andrew Bergman,6 176 991,6 367 023

In [303]:
df_admissions_EU.rename(columns={'Admissions 1996-1996' : 'tickets_sold',
                                 'Total EU27+GB since 1996' : 'tickets_sold_since_1996',
                                 'Original title' : 'title',
                                 'Production year' : 'year'}, inplace=True)
df_admissions_EU.columns = df_admissions_EU.columns.str.lower().str.replace(' ', '_')
df_admissions_EU.drop(columns=['directors'], inplace=True)

In [304]:
df_admissions_EU['tickets_sold'] = df_admissions_EU['tickets_sold'].str.replace(' ', '')
df_admissions_EU['tickets_sold_since_1996'] = df_admissions_EU['tickets_sold_since_1996'].str.replace(' ', '')

In [305]:
df_admissions_EU['tickets_sold'] = pd.to_numeric(df_admissions_EU['tickets_sold'])
df_admissions_EU['tickets_sold_since_1996'] = pd.to_numeric(df_admissions_EU['tickets_sold_since_1996'])

In [306]:
df_admissions_EU.shape

(5600, 5)

In [307]:
df_admissions_EU['title'].nunique()

4916

In [308]:
df_admissions_EU_clean = df_admissions_EU.groupby(['title', 'producing_country', 'year', 'tickets_sold_since_1996']).sum().reset_index()
df_admissions_EU_clean

,title,producing_country,year,tickets_sold_since_1996,tickets_sold
0,(500) Days of Summer,US,2009,1713086,1684771
1,(Nie)znajomi,PL,2019,685075,684833
2,(T)Raumschiff Surprise - Periode 1,DE,2004,10763531,10731881
3,1 1/2 Ritter - Auf der Suche nach der hinreiße...,DE,2008,1986168,1986168
4,1 chance sur 2,FR,1998,1295620,1238175
...,...,...,...,...,...
4951,Ölümlü Dünya 2,TR,2023,1476943,1476943
4952,Účastníci zájezdu,CZ,2006,871439,830242
4953,Śluby panieńskie,PL,2010,1001866,1000373
4954,Świadectwo,PL,2008,1039901,1034911
4955,Ženy v pokušení,CZ,2010,1309118,1303914

In [309]:
display(df_admissions_EU_clean[df_admissions_EU_clean['title'] == 'Avatar'])
display(df_admissions_EU[df_admissions_EU['title'] == 'Avatar'])

      title producing_country  year  tickets_sold_since_1996  tickets_sold
377  Avatar                US  2009                 82622233      82505798

       title producing_country  year  tickets_sold  tickets_sold_since_1996
2603  Avatar                US  2009      24536394                 82622233
2800  Avatar                US  2009      55024931                 82622233
5236  Avatar                US  2009       2944473                 82622233

In [310]:
df_admissions_EU_clean.head(20)

,title,producing_country,year,tickets_sold_since_1996,tickets_sold
0,(500) Days of Summer,US,2009,1713086,1684771
1,(Nie)znajomi,PL,2019,685075,684833
2,(T)Raumschiff Surprise - Periode 1,DE,2004,10763531,10731881
3,1 1/2 Ritter - Auf der Suche nach der hinreiße...,DE,2008,1986168,1986168
4,1 chance sur 2,FR,1998,1295620,1238175
5,10 Cloverfield Lane,US,2016,2159630,2158947
6,10 Things I Hate About You,US,1999,2537429,2418949
7,10 giorni senza mamma,IT,2019,1206366,1204887
8,10 jours encore sans maman,FR,2023,769522,769522
9,10 jours sans maman,FR,2020,1329834,1326695
10,"10,000 BC",US,2008,7626265,7623301
11,100 Dinge,DE,2018,1868834,1850511
12,100% Wolf,AU,2020,948226,914430
13,101 Dalmatians,US,1996,21623260,21532085
14,102 Dalmatians,US,2000,13901278,13886567
15,12 Strong,US,2018,882755,882746
16,12 Years a Slave,"US, GB",2013,9722774,9291201
17,120,TR,2008,1075680,1066454
18,120 battements par minute,FR,2017,1044121,893887
19,127 Hours,"US, GB",2010,2787027,2783713

### Ticket sales in North America

In [311]:
df_admissions_NA = pd.read_csv('./Data/Movie_numbers_1996-2023_USA.csv')
df_admissions_NA.head(20)

,Rank,Movie,Release\nDate,Year,Distributor,Genre,1996 Gross,Tickets Sold
0,1,Independence Day,7/2/1996,1996,20th Century Fox,Adventure,"$306,169,255","69,269,062"
1,2,Twister,5/10/1996,1996,Warner Bros.,Action,"$241,688,385","54,680,630"
2,3,Mission: Impossible,5/21/1996,1996,Paramount Pictures,Action,"$180,981,886","40,946,128"
3,4,The Rock,6/7/1996,1996,Walt Disney,Action,"$134,069,511","30,332,468"
4,5,Ransom,11/8/1996,1996,Walt Disney,Action,"$129,181,606","29,226,607"
5,6,The Nutty Professor,6/28/1996,1996,Universal,Comedy,"$128,814,019","29,143,443"
6,7,The Birdcage,3/8/1996,1996,MGM,Comedy,"$124,060,553","28,067,998"
7,8,101 Dalmatians,11/27/1996,1996,Walt Disney,Adventure,"$121,795,758","27,555,601"
8,9,A Time to Kill,7/24/1996,1996,Warner Bros.,Drama,"$108,766,007","24,607,693"
9,10,The First Wives Club,9/20/1996,1996,Paramount Pictures,Comedy,"$104,670,012","23,680,998"
10,11,Phenomenon,7/5/1996,1996,Walt Disney,Drama,"$104,539,127","23,651,386"
11,12,Eraser,6/21/1996,1996,Warner Bros.,Action,"$101,295,562","22,917,547"
12,13,The Hunchback of Notre Dame,6/21/1996,1996,Walt Disney,Adventure,"$100,138,851","22,655,848"
13,14,Star Trek: First Contact,11/22/1996,1996,Paramount Pictures,Adventure,"$89,187,714","20,178,215"
14,15,Space Jam,11/15/1996,1996,Warner Bros.,Adventure,"$85,442,296","19,330,836"
15,16,Jerry Maguire,12/13/1996,1996,Sony Pictures,Romantic Comedy,"$83,338,125","18,854,779"
16,17,Mr. Holland's Opus,12/29/1995,1996,Walt Disney,Drama,"$82,450,788","18,654,024"
17,18,Broken Arrow,2/9/1996,1996,20th Century Fox,Action,"$70,645,997","15,983,257"
18,19,The Cable Guy,6/14/1996,1996,Sony Pictures,Black Comedy,"$60,240,295","13,629,026"
19,20,Courage Under Fire,7/12/1996,1996,20th Century Fox,Drama,"$59,003,384","13,349,181"

In [312]:
df_admissions_NA.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5600 entries, 0 to 5599
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Rank          5600 non-null   int64
 1   Movie         5600 non-null   object
 2   Release
Date  5594 non-null   object
 3   Year          5600 non-null   int64
 4   Distributor   5580 non-null   object
 5   Genre         5596 non-null   object
 6   1996 Gross    5600 non-null   object
 7   Tickets Sold  5600 non-null   object
dtypes: int64(2), object(6)
memory usage: 350.1+ KB

In [313]:
df_admissions_NA['Release\nDate'] = pd.to_datetime(df_admissions_NA['Release\nDate'])
df_admissions_NA['Tickets Sold'] = df_admissions_NA['Tickets Sold'].str.replace(',', '')
df_admissions_NA['Tickets Sold'] = pd.to_numeric(df_admissions_NA['Tickets Sold'])

In [314]:
df_admissions_NA['1996 Gross'] = df_admissions_NA['1996 Gross'].str.replace(',', '')
df_admissions_NA['1996 Gross'] = df_admissions_NA['1996 Gross'].str.replace('$', '')

C:\Users\Luca\AppData\Local\Temp\ipykernel_10516\2233214535.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df_admissions_NA['1996 Gross'] = df_admissions_NA['1996 Gross'].str.replace('$', '')

In [315]:
df_admissions_NA['1996 Gross'] = pd.to_numeric(df_admissions_NA['1996 Gross'])

In [316]:
df_admissions_NA.rename(columns={'Release\nDate' : 'release_date',
                                 'Movie' : 'title',
                                 '1996 Gross' : 'Gross_Sales',
                                 'Tickets Sold' : 'tickets_sold'}, inplace=True)
df_admissions_NA.columns = df_admissions_NA.columns.str.lower()
df_admissions_NA.columns

Index(['rank', 'title', 'release_date', 'year', 'distributor', 'genre',
       'gross_sales', 'tickets_sold'],
      dtype='object')

In [317]:
df_admissions_NA['title'].nunique()

4915

In [318]:
df_admissions_NA_clean = df_admissions_NA.groupby(['title', 'release_date']).sum().reset_index()
df_admissions_NA_clean.drop(columns=['rank', 'year'], inplace=True)
df_admissions_NA_clean.shape

C:\Users\Luca\AppData\Local\Temp\ipykernel_10516\1499433655.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df_admissions_NA_clean = df_admissions_NA.groupby(['title', 'release_date']).sum().reset_index()

(4978, 4)

In [319]:
display(df_admissions_NA_clean[df_admissions_NA_clean['title'] == 'Avatar'])
display(df_admissions_NA[df_admissions_NA['title'] == 'Avatar'])

      title release_date  gross_sales  tickets_sold
392  Avatar   2009-12-18    785221649     101056465

,rank,title,release_date,year,distributor,genre,gross_sales,tickets_sold
2601,2,Avatar,2009-12-18,2009,20th Century Fox,Action,352114898,46948653
2801,2,Avatar,2009-12-18,2010,20th Century Fox,Action,408392727,51760802
5247,48,Avatar,2009-12-18,2022,20th Century Fox,Action,24714024,2347010

In [320]:
df_admissions_NA_clean.groupby(['title']).size().sort_values(ascending=False)

title
The Lord of the Rings: The …    4
Halloween                       3
Shaft                           2
The Postman                     2
Supernova                       2
                               ..
Hellboy 2: The Golden Army      1
Hell or High Water              1
Hell Fest                       1
Held Up                         1
xXx: Return of Xander Cage      1
Length: 4914, dtype: int64

In [321]:
df_admissions_NA_clean[df_admissions_NA_clean['title'] == 'Halloween']

          title release_date  gross_sales  tickets_sold
1605  Halloween   1978-10-17       274000         29847
1606  Halloween   2007-08-31     58269151       8469353
1607  Halloween   2018-10-19    159341510      17490835

In [322]:
display(df_admissions_NA_clean.head())
display(df_admissions_EU_clean.head())

                        title release_date  gross_sales  tickets_sold
0        (500) Days of Summer   2009-08-07     32425665       4323422
1         10 Cloverfield Lane   2016-03-11     72082999       8333294
2  10 Things I Hate About You   1999-03-31     38177966       7515347
3                 10,000 B.C.   2008-03-07     94784201      13201142
4              101 Dalmatians   1996-11-27    136189294      30691447

,title,producing_country,year,tickets_sold_since_1996,tickets_sold
0,(500) Days of Summer,US,2009,1713086,1684771
1,(Nie)znajomi,PL,2019,685075,684833
2,(T)Raumschiff Surprise - Periode 1,DE,2004,10763531,10731881
3,1 1/2 Ritter - Auf der Suche nach der hinreiße...,DE,2008,1986168,1986168
4,1 chance sur 2,FR,1998,1295620,1238175

### IMDB DATA

In [324]:
df_movie_list_years = pd.read_csv('./Data/movie_list_years.csv')
df_akas = pd.read_csv('./Data/title.akas.csv')
df_basics = pd.read_csv('./Data/title.basics.csv')
df_crew = pd.read_csv('./Data/title.crew.csv')
df_principals = pd.read_csv('./Data/title.principals.csv')
df_ratings = pd.read_csv('./Data/title.ratings.csv')
df_names = pd.read_csv('./Data/name.basics.csv')

In [329]:
df_movie_list_years.replace('\\N', np.nan, inplace=True)
df_akas.replace('\\N', np.nan, inplace=True)
df_basics.replace('\\N', np.nan, inplace=True)
df_crew.replace('\\N', np.nan, inplace=True)
df_principals.replace('\\N', np.nan, inplace=True)
df_ratings.replace('\\N', np.nan, inplace=True)
df_names.replace('\\N', np.nan, inplace=True)

In [330]:
display(df_movie_list_years.head(), df_akas.head(), df_basics.head(), df_crew.head(), df_principals.head(), df_ratings.head(), df_names.head())

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0011801,movie,Tötet nicht mehr,Tötet nicht mehr,0,2019,NaN,NaN,"Action,Crime"
1,tt0013274,movie,Istoriya grazhdanskoy voyny,Istoriya grazhdanskoy voyny,0,2021,NaN,94,Documentary
2,tt0015414,movie,La tierra de los toros,La tierra de los toros,0,2000,NaN,60,NaN
3,tt0015724,movie,Dama de noche,Dama de noche,0,1993,NaN,102,"Drama,Mystery,Romance"
4,tt0021617,movie,Arizona Territory,Arizona Territory,0,1950,NaN,56,Western

,tconst,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Carmencita,NaN,NaN,original,NaN,1.0
1,tt0000001,2,Carmencita,DE,NaN,NaN,literal title,0.0
2,tt0000001,3,Carmencita,US,NaN,imdbDisplay,NaN,0.0
3,tt0000001,4,Carmencita - spanyol tánc,HU,NaN,imdbDisplay,NaN,0.0
4,tt0000001,5,Καρμενσίτα,GR,NaN,imdbDisplay,NaN,0.0

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0.0,1894.0,NaN,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0.0,1892.0,NaN,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0.0,1892.0,NaN,5,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0.0,1892.0,NaN,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0.0,1893.0,NaN,1,"Comedy,Short"

      tconst  directors writers
0  tt0000001  nm0005690     NaN
1  tt0000002  nm0721526     NaN
2  tt0000003  nm0721526     NaN
3  tt0000004  nm0721526     NaN
4  tt0000005  nm0005690     NaN

,tconst,ordering,nconst,category,job,characters
0,tt0000001,1,nm1588970,self,NaN,"[""Self""]"
1,tt0000001,2,nm0005690,director,NaN,NaN
2,tt0000001,3,nm0005690,producer,producer,NaN
3,tt0000001,4,nm0374658,cinematographer,director of photography,NaN
4,tt0000002,1,nm0721526,director,NaN,NaN

      tconst  averageRating  numVotes
0  tt0000001            5.7      2082
1  tt0000002            5.6       280
2  tt0000003            6.5      2081
3  tt0000004            5.4       181
4  tt0000005            6.2      2819

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899,1987,"actor,miscellaneous,producer","tt0072308,tt0050419,tt0053137,tt0027125"
1,nm0000002,Lauren Bacall,1924,2014,"actress,soundtrack,archive_footage","tt0037382,tt0075213,tt0117057,tt0038355"
2,nm0000003,Brigitte Bardot,1934,NaN,"actress,music_department,producer","tt0057345,tt0049189,tt0056404,tt0054452"
3,nm0000004,John Belushi,1949,1982,"actor,writer,music_department","tt0072562,tt0077975,tt0080455,tt0078723"
4,nm0000005,Ingmar Bergman,1918,2007,"writer,director,actor","tt0050986,tt0083922,tt0050976,tt0069467"

In [333]:
df_crew_named = df_crew.merge(df_names, how='left', left_on='directors', right_on='nconst')
df_crew_named.drop(columns=['nconst', 'birthYear', 'deathYear', 'primaryProfession'], inplace=True)

In [338]:
df_crew_named.rename(columns={'primaryName' : 'directors_name',
                              'knownForTitles' : 'known_for_directing'}, inplace=True)

In [347]:
df_crew_named['writers'].str.count(',').sort_values(ascending=False)

427635      1359.0
3708478     1088.0
3175112      746.0
790006       652.0
8004000      649.0
             ...
10401642       NaN
10401648       NaN
10401654       NaN
10401658       NaN
10401667       NaN
Name: writers, Length: 10401681, dtype: float64

In [350]:
df_crew_named.iloc[427635]

tconst                                                         tt0441074
directors              nm0417370,nm0361540,nm3874442,nm0344761,nm1337...
writers                nm2556881,nm0417370,nm0051304,nm0610720,nm0293...
directors_name                                                       NaN
known_for_directing                                                  NaN
Name: 427635, dtype: object

In [351]:
df_imdb_final = df_movie_list_years.merge(df_crew, how='left', on='tconst')

In [366]:
df_imdb_final.shape

(664040, 12)

In [353]:
df_imdb_final['directors'].str.count(',').nunique()

54

In [363]:
df_imdb_final['directors_count'] = df_imdb_final['directors'].str.count(',') + 1
df_imdb_final['directors_count'].value_counts()/len(df_imdb_final) * 100

1.0     84.594452
2.0      7.370490
3.0      0.791820
4.0      0.215951
5.0      0.112041
6.0      0.066261
7.0      0.045329
8.0      0.032076
10.0     0.025601
9.0      0.022438
11.0     0.010993
12.0     0.007530
13.0     0.006927
15.0     0.003313
14.0     0.003012
18.0     0.001958
19.0     0.001958
20.0     0.001958
16.0     0.001807
22.0     0.001355
21.0     0.001355
17.0     0.001355
31.0     0.001205
26.0     0.000904
27.0     0.000753
34.0     0.000602
25.0     0.000602
24.0     0.000602
40.0     0.000452
39.0     0.000452
28.0     0.000452
29.0     0.000452
51.0     0.000452
32.0     0.000452
30.0     0.000301
38.0     0.000301
36.0     0.000301
41.0     0.000301
53.0     0.000301
33.0     0.000301
23.0     0.000301
58.0     0.000151
46.0     0.000151
48.0     0.000151
87.0     0.000151
59.0     0.000151
74.0     0.000151
63.0     0.000151
50.0     0.000151
57.0     0.000151
35.0     0.000151
64.0     0.000151
69.0     0.000151
66.0     0.000151
Name: directors_count, dtype: float64

In [382]:
df_imdb_final[['director', 'director2', 'director3']] = df_imdb_final['directors'].str.split(',', n=2, expand=True)
df_imdb_final.drop(columns='directors', inplace=True)

In [394]:
df_imdb_final['writers_count'] = df_imdb_final['writers'].str.count(',') + 1
df_imdb_final['writers_count'].value_counts()/len(df_imdb_final[df_imdb_final['writers_count'].notnull()]) * 100

1.0     57.298044
2.0     27.671105
3.0      9.598918
4.0      3.254905
5.0      1.148129
6.0      0.463667
7.0      0.211159
8.0      0.117222
9.0      0.073263
10.0     0.061220
11.0     0.025692
12.0     0.018065
13.0     0.013248
15.0     0.008832
14.0     0.008230
16.0     0.003613
17.0     0.003412
18.0     0.002810
22.0     0.002007
19.0     0.001806
21.0     0.001606
25.0     0.001606
23.0     0.001606
20.0     0.001405
24.0     0.001204
27.0     0.000803
29.0     0.000803
30.0     0.000602
28.0     0.000602
32.0     0.000401
33.0     0.000401
43.0     0.000401
26.0     0.000401
39.0     0.000401
42.0     0.000201
52.0     0.000201
64.0     0.000201
49.0     0.000201
47.0     0.000201
58.0     0.000201
41.0     0.000201
51.0     0.000201
69.0     0.000201
35.0     0.000201
31.0     0.000201
36.0     0.000201
Name: writers_count, dtype: float64

In [395]:
df_imdb_final

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,writers,directors_count,director,director2,director3,writers_count
0,tt0011801,movie,Tötet nicht mehr,Tötet nicht mehr,0,2019,NaN,NaN,"Action,Crime","nm0483944,nm0681726",1.0,nm0681726,None,None,2.0
1,tt0013274,movie,Istoriya grazhdanskoy voyny,Istoriya grazhdanskoy voyny,0,2021,NaN,94,Documentary,NaN,2.0,nm0412842,nm0895048,None,NaN
2,tt0015414,movie,La tierra de los toros,La tierra de los toros,0,2000,NaN,60,NaN,NaN,1.0,nm0615736,None,None,NaN
3,tt0015724,movie,Dama de noche,Dama de noche,0,1993,NaN,102,"Drama,Mystery,Romance","nm0529960,nm1597742",1.0,nm0529960,None,None,2.0
4,tt0021617,movie,Arizona Territory,Arizona Territory,0,1950,NaN,56,Western,nm0119378,1.0,nm0289297,None,None,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
664035,tt9916680,movie,De la ilusión al desconcierto: cine colombiano...,De la ilusión al desconcierto: cine colombiano...,0,2007,NaN,100,Documentary,"nm0652213,nm10538576",1.0,nm0652213,None,None,2.0
664036,tt9916692,tvMovie,Teatroteka: Czlowiek bez twarzy,Teatroteka: Czlowiek bez twarzy,0,2015,NaN,66,Drama,nm10538592,1.0,nm10538592,None,None,1.0
664037,tt9916706,movie,Dankyavar Danka,Dankyavar Danka,0,2013,NaN,NaN,Comedy,nm7933903,1.0,nm7764440,None,None,1.0
664038,tt9916730,movie,6 Gunn,6 Gunn,0,2017,NaN,116,Drama,nm10538612,1.0,nm10538612,None,None,1.0
664039,tt9916754,movie,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,0,2013,NaN,49,Documentary,"nm8349149,nm9272490",2.0,nm9272490,nm8349149,None,2.0

In [326]:
df_akas.rename(columns={'titleId' : 'tconst'}, inplace=True)